Revit 2027 API
ElectricalDemandFactorValue(Double, Double, Double) Constructor
 Constructor. Initializes factor, minimum range and maximum range to values passed in.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalDemandFactorValue(
	double minRange,
	double maxRange,
	double factor
)
Public Sub New (
	minRange As Double,
	maxRange As Double,
	factor As Double
)
public:
ElectricalDemandFactorValue(
	double minRange,
	double maxRange,
	double factor
)
new :
        minRange : float *
        maxRange : float *
        factor : float -> ElectricalDemandFactorValue
Parameters
minRange Double
maxRange Double
factor Double
See Also
Reference
ElectricalDemandFactorValue Class
ElectricalDemandFactorValue Overload
Autodesk.Revit.DB.Electrical Namespace